{
    "title": "Jogo da Vida",
    "play": "Iniciar",
    "stop": "Parar",
    "clear": "Zerar",
    "reset": "Recompor",
    "menu": "Menu",
    "speed": "Velocidade",
    "size": "Tamanho",
    "cells": "Células",
    "used": "Usado",
    "info": "Info",
    "alive": "Vivas",
    "births": "Nascimentos",
    "deaths": "Mortes",
    "presets": "Predefinidas",
    "users": "Do Usuário",
    "sizerange": "Seta o tamanho da célula",
    "speedanim": "Seta a velocidade da animação",
    "newscreen": "Nova Tela",
    "delscreen": "Deletar Tela",
    "blank": "Em Branco",
    "language": "Língua",
    "savedscreens": "Telas Salvas",
    "color": "Cor",
    "alignment": "Oções de Alinhamento",
    "align-nw": "Topo Esquerda",
    "align-nc": "Topo Centro",
    "align-ne": "Topo Direita",

    "align-cw": "Centro Esquerda",
    "align-cc": "Centralizado",
    "align-ce": "Centro Direita",

    "align-bw": "Embaixo Esquerda",
    "align-bc": "Embaixo Centro",
    "align-be": "Embaixo Direita",
    "moveup": "Mover tudo uma linha pra cima",
    "movedown": "Mover tudo uma linha pra baixo",
    "moveleft": "Mover tudo uma coluna pra esquerda",
    "moveright": "Mover tudo uma coluna pra direita",
    "errnameexists": "Nome já existe na lista!",
    "errnoload": "Tela não pôde ser carregada",
    "whatis1": "O Jogo da Vida de Conway é um autômato celular criado pelo matemático John Horton Conway em 1970. É um jogo sem jogadores, o que significa que sua evolução é determinada por seu estado inicial, sem necessidade de entrada adicional. O jogo se desenrola em uma grade de células, cada uma das quais pode estar viva ou morta. O estado de cada célula muda em intervalos de tempo discretos com base em regras simples que consideram os oito vizinhos da célula. Por exemplo, uma célula viva morre por subpopulação (menos de dois vizinhos vivos) ou superpopulação (mais de três vizinhos vivos), enquanto uma célula morta ganha vida com exatamente três vizinhos vivos. Apesar de sua simplicidade, o Jogo da Vida pode produzir padrões complexos e imprevisíveis, incluindo planadores, osciladores e até estruturas autorreplicantes.",
    "whatis2": "O Jogo da Vida é significativo em ciência da computação, matemática e biologia teórica, pois demonstra como comportamentos complexos podem emergir de regras simples. É Turing completo, o que significa que pode realizar qualquer cálculo, dada a configuração inicial correta. Pesquisadores o utilizaram para explorar a auto-organização, a emergência e os limites entre ordem e caos. O apelo do jogo reside em sua mistura de simplicidade e profundidade, inspirando inúmeras variações e aplicações em campos como vida artificial, teoria da complexidade e até mesmo arte. Continua sendo um exemplo clássico de como regras determinísticas podem dar origem a sistemas aparentemente orgânicos e dinâmicos.",
    "howto1": "Para jogar você deve criar células no tabuleiro. Para isso basta clicar/tocar e arrastar. Você pode também escolher uma das telas salvas. O jogo aplica suas regras e refaz o tabuleiro de acordo. Isso é chamado de geração.",
    "howto2": "O jogo acaba quando não houverem mudanças de uma geração para outra. Você pode interagir com o jogo criando mais células mesmo enquanto o jogo está rodando. Para iniciar clique/toque em Play <b>(1)</b>.",
    "howto3": "<b>(2)</b> Restaura a grade e <b>(3)</b> a zera, ou seja, deixa vazia. <b>(4)</b> invoca esta tela e <b>(5)</b> salva uma tela como sua. Esta tela é salva no dispositivo e pode ser carregada a partir do dropdown de telas salvas.",
    "howto4": "<b>(6)</b> é o contador de gerações, <b>(7)</b> são os controles de alinhamento. Estes controles permitem que você mova a tela para cima, baixo e lados além de posicionar o que estiver na tela de acordo com o pequeno grid de 9 posições no centro. <b>(8)</b> é a escala de uso da tela. 100% quer dizer que todos os espaços visíveis estão ou já foram ocupados por uma célula viva.",
    "withlove": "Feito com ❤️ por Walter Staeblein",
    "bmc": "Me paga um café",
    "free": "Este web app é 100% gratuito e pode ser usado sem restrições."
}